"""
定义所有错误的code与描述
"""

error_message = {
    501: "请求方式错误",
    502: "请求参数验证失败",
    503: "授权认证失败",
    504: "",

    2002: "数据异常",
    2017: "密码长度只能6位",
    2018: "密码只能使用字母或数字",

    2101: "用户不存在",
    2102: "登录异常",
    2103: "退出失败",
    2104: "用户名或密码错误",
    2105: "您的账号已存在",
    2106: "您的账号因违规已被封禁！",
    2107: "修改Aha号失败",
    2108: "已经设置过aha号, 无法再次更改",
    2109: "无此环信ID",
    2110: "变更拉黑状态失败",
    2111: "您与对方是拉黑关系，无法进行此操作",
    2112: "动态不存在，或被删除",

    2113: "订单价格错误",
    2114: "打赏金额太少啦，大方一点吧",
    2115: "收货人不允许为空",
    2116: "请输入邮箱",
    2117: "请输入手机号",
    2118: "地址信息录入失败",
    2119: "对方还没有设置微信号",
    2120: "微信下单失败",
    2121: "支付宝参数验证失败",
    2122: "支付宝支付失败",
    2123: "订单不存在",

    2124: "不能重复举报",
    2125: "只有男性用户能发悬赏",
    2126: "上一个悬赏还未结束",
    2127: "悬赏发布失败",
    2128: "这不是你的悬赏",
    2129: "这个悬赏已经结束",
    2130: "这个悬赏已经选定获胜者了",
    2131: "这个人没有报名此悬赏",

    2201: "不可以发纯文本动态哦~",
    2202: "上传视频内容为空",
    2203: "视频封面缺失",
    2204: "上传音频缺失",

    2301: "自己不能关注自己",

    2401: "请上传您的头像",
    2402: "请上传图片",
    2403: "上传修改封面失败",
    2404: "超过相册存储最大限制",
    2405: "该动态不存在",
    2406: "回复的评论不存在",
    2407: "您上传的图片过多",
    2408: "您无权限添加微信号",
    2409: "微信价格限制为99~1314",
    2410: "上传私密视频失败",

    5010: "验证码用完了，请明天再来吧。",
    5011: "用户不存在，请检查您的手机号",
    5012: "验证码发送失败",

    5100: "昵称不能为空",
    5101: "该昵称已被占用",

    10001: "验证码错误",
}