"""
定义所有错误的code与描述
"""

error_message = {
    501: "请求方式错误",
    502: "请求参数验证失败",
    503: "授权认证失败",
    504: "",

    2002: "数据异常",
    2017: "密码长度只能6位",
    2018: "密码只能使用字母或数字",

    2101: "用户不存在",
    2102: "登录异常",
    2103: "退出失败",
    2104: "用户名或密码错误",
    2105: "您的账号已存在",
    2106: "您的账号因违规已被封禁！",
    2107: "修改Aha号失败",
    2108: "已经设置过aha号, 无法再次更改",

    2201: "不可以发纯文本动态哦~",

    2301: "自己不能关注自己",

    2401: "请上传您的头像",
    2402: "请上传图片",
    2403: "上传修改封面失败",
    2404: "超过相册存储最大限制",
    2405: "该动态不存在",
    2406: "回复的评论不存在",
    2407: "您上传的图片过多",
    2408: "您无权限添加微信号",
    2409: "微信价格限制为99~1314",

    5010: "验证码用完了，请明天再来吧。",
    5011: "用户不存在，请检查您的手机号",
    5012: "验证码发送失败",

    5100: "昵称不能为空",
    5101: "该昵称已被占用",

    10001: "验证码错误",
}